[
  {
    "path": "posts/welcome/",
    "title": "Welcome to My DataViz Makeovers",
    "description": "Welcome to our new blog, My DataViz Makeovers. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Rhoda Tong",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-05-28",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-28T11:36:57+08:00",
    "input_file": "welcome.utf8.md"
  },
  {
    "path": "posts/2021-05-28-dataviz-makeover-1/",
    "title": "DataViz MakeOver #1",
    "description": "Giving a trade statistic visualization chart a facelift in Tableau.",
    "author": [
      {
        "name": "Rhoda Tong",
        "url": "https://example.com/notapp"
      }
    ],
    "date": "2021-05-28",
    "categories": [],
    "contents": "\r\nOverview\r\nStatistics on merchandise trade data for various regions and markets are compiled by Enterprise Singapore, and provided by Department of Statistics (DOS), Singapore. From this dataset, a chart depicting the import and export volumes for the top 6 trading countries for the year 2019 – 2020 was generated. We have attempted a ‘makeover’ on this chart using Tableau to improve on its clarity. This post would illustrate the makeover process and cover the following sections:\r\nThe Original Visualization\r\nCritique to Identify Areas for Improvement\r\nSketch of Proposed Design & Comments\r\nStep-by-Step Guide to Creating the Proposed Visualization in Tableau\r\nThe Final Visualization\r\n3 Major Insights Revealed by the Final Visualization Prepared\r\nReferences\r\n1. The Original Visualization\r\n\r\n2. Critique to Identify Areas for Improvement\r\n2.1 Clarity\r\nThere are no captions or commentaries. It is not clear what message is to be conveyed with the charts.\r\nTitle does not match what is illustrated in the charts. Title says 2019 – 2020, but according to the x-axes of the charts, the periods illustrated are mostly 2019 – 2021, and only 2020 for Japan. It is not clear what the scope of the visualization is.\r\nThe X-axis titles are inconsistent with label markings and graphs presented. Which month and which period does “Month of Period” refer to? The variation of the line graphs show that the data presented has a higher resolution than “Year” but it is not clear what resolution it is exactly. There are also no tick marks on the axis nor gridlines in the chart area, the reader is unable to reference which data points correspond to which and what time units.\r\nThe Y-axes have no units. It is not clear what the unit of measurement is. It is also not clear what ‘M’ in the axis labels stand for. The scale between the primary and secondary Y-axis for is different within the chart of each country, this would mislead the reader in terms of interpretation of how the import and export volumes compare with each other. The different scales between the charts of each country would mislead the reader as well – for e.g. direct glance of the charts of Mainland China and Japan shows as if both countries have similar import/export volume, when their quantities are actually different. Comparison of import and export volumes across countries is rather painful.\r\n2.2 Aesthetics\r\nTitle is too small and does not stand out. The font size is even smaller than the individual chart titles. The alignment is off-centre as well.\r\nDisplay of country charts is not in any order of trade volume. The reader must decipher the measures on his/her own from the charts before the order can be determined.\r\nThe dimensions of each country chart are inconsistent and misaligned. E.g. The width of Hong Kong’s chart is narrower than that of Malaysia’s. This makes the overall outlook messy.\r\nThe type of chart (area chart) applied here is unsuitable as we can hardly differentiate between the chart for import and export. The area overlaps also masked the actual charts and inadvertently created a third shade of colour which made the charts even difficult to interpret.\r\nThe colours chosen for the area charts are unfriendly to those who are colour-blind - protanopes and deuteranopes will not be able to differentiate between the two shades.\r\nAbbreviation is used for United States. When it is used as a location or noun, it should be spelt out in full.\r\n3. Sketch of Proposed Design\r\nSketched on Microsoft OneNote for Windows 10\r\n4. Step-by-Step Guide: Creating the Proposed Visualization in Tableau\r\n4.1 Data Preparation\r\nThe respective Imports and Exports data are extracted from the DOS website, as OutputFile.xlsx.\r\nExploring the data of the file in Microsoft Excel, we can see three tabs – Content, T1 and T2. From the description, T1 is for Imports, and T2 is for Exports data.\r\n\r\nWe then import the data into Tableau for processing. We do this by dragging the OutputFile.xlsx file into the Tableau window.\r\n\r\nOnce the data is imported, we load the individual tabs for data viewing. Here we load T1 (Imports) data by dragging T1 into the field.\r\n\r\nFor easier reference, we rename the data table to ‘Imports’.\r\nRight-click T1 > Rename\r\n We note that there is unnecessary description information in the data table. We can get Tableau to clean this up by checking the Data Interpreter box. Tableau is able to scan through and distinguish the content. This way, only the table containing the data we need remains.\r\n\r\nIn the current data structure, each Month-Year is a column but we need this as a Dimension. So we do a pivot on the dataset to convert it to stacked format.\r\nHighlight all the data columns except the Country column > Right-Click on any highlighted column > Pivot\r\n\r\nIn the stacked format, rename the columns for easier reference.\r\n Next we repeat the above steps for T2 (Exports) dataset.\r\nDrag T2 into the field.\r\n\r\nWe need to tell Tableau how T2 (Exports) is related to Imports. In this case, they are related by their Year Month and Country. As Tableau does not allow the same name for different columns, just rename the columns in the Exports dataset as Year Month 2 and Country 2 after doing the pivoting.\r\n\r\n For both tables, we should check that variables are recognized in the correct format.\r\nYear Month -> Date\r\nImport / Export -> # (Number)\r\nCountry -> Abc (String)\r\nOnly Year Month is not in the correct format yet. Change that to Date format.\r\n\r\nNote that the Country names are illustrated together with the units (Thousand dollars). These units will also appear in the visualization chart labels. We can amend this by doing a Custom Split on the Country column.\r\nUse the separator ‘(‘ , and split off the first 1 column.\r\n\r\nNow you will have the country labels on their own.\r\n\r\nSince the units are now excluded, they have been included back under the respective Import and Export data columns as Import($’000) and .\r\nAccording to the Task, we only need to illustrate data for the period 2019-2020 and for 6 countries : Japan, Hong Kong, Taiwan, United States, Malaysia and Mainland China. This data is filtered out using Filters.\r\n\r\n4.2 Visualization Chart Preparation\r\n5. The Final Visualization\r\n6. 3 Major Insights Revealed by the Final Visualization\r\n7. References\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-28T18:18:36+08:00",
    "input_file": "dataviz-makeover-1.utf8.md"
  }
]
